[
    {
        "ayah_number": 1,
        "arabic": "اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
        "reference": "Sahih Muslim 592",
        "bangla_pronunciation": "আল্লাহুম্মা আনতাস-সালাম, ওয়া মিনকাস-সালাম, তাবারাকতা বা যাল-জালালি ওয়াল-ইকরাম।",
        "english_pronunciation": "Allahumma Antas-Salam, wa minkas-Salam, tabarakta ya dhal-jalali wal-ikram.",
        "bangla_translation": "হে আল্লাহ! আপনি শান্তি, শান্তি আপনার থেকেই আসে। আপনি বরকতময়, হে গৌরব ও মহিমার অধিকারী!",
        "english_translation": "O Allah! You are Peace, and from You comes peace. Blessed are You, O Possessor of Glory and Honor!",
        "audio_link": "https://www.islamicfinder.org/audio/dua/65.mp3"
    },
    {
        "ayah_number": 2,
        "arabic": "لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "reference": "Sahih al-Bukhari 6403, Sahih Muslim 594",
        "bangla_pronunciation": "লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারিকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়া হুয়া ‘আলা কুল্লি শাই’ইন ক্বাদির।",
        "english_pronunciation": "La ilaha illallahu wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa huwa ‘ala kulli shay’in qadir.",
        "bangla_translation": "আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই, তিনি এক ও অদ্বিতীয়, তাঁর কোনো শরিক নেই, তাঁরই রাজত্ব ও প্রশংসা, এবং তিনি সব কিছুর উপর ক্ষমতাশালী।",
        "english_translation": "There is no deity but Allah, alone, without a partner. To Him belongs sovereignty and praise, and He has power over all things.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/66.mp3"
    },
    {
        "ayah_number": 3,
        "arabic": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ",
        "reference": "Sahih Muslim 595",
        "bangla_pronunciation": "সুবহানাল্লাহ, ওয়াল হামদু লিল্লাহ, ওয়াল্লাহু আকবার।",
        "english_pronunciation": "SubhanAllah, walhamdulillah, wallahu akbar.",
        "bangla_translation": "আল্লাহ পবিত্র, সমস্ত প্রশংসা আল্লাহর, এবং আল্লাহ সর্বশ্রেষ্ঠ।",
        "english_translation": "Glory be to Allah, all praise is for Allah, and Allah is the Greatest.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/67.mp3"
    },
    {
        "ayah_number": 4,
        "arabic": "أَسْتَغْفِرُ اللَّهَ، أَسْتَغْفِرُ اللَّهَ، أَسْتَغْفِرُ اللَّهَ",
        "reference": "Sahih Muslim 596",
        "bangla_pronunciation": "আস্তাগফিরুল্লাহ, আস্তাগফিরুল্লাহ, আস্তাগফিরুল্লাহ।",
        "english_pronunciation": "Astaghfirullah, Astaghfirullah, Astaghfirullah.",
        "bangla_translation": "আমি আল্লাহর কাছে ক্ষমা চাই, আমি আল্লাহর কাছে ক্ষমা চাই, আমি আল্লাহর কাছে ক্ষমা চাই।",
        "english_translation": "I seek Allah's forgiveness, I seek Allah's forgiveness, I seek Allah's forgiveness.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/68.mp3"
    },
    {
        "ayah_number": 5,
        "arabic": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
        "reference": "Sunan Abi Dawood 1522",
        "bangla_pronunciation": "আল্লাহুম্মা আ’িন্নি ‘আলা জিকরিকা, ওয়া শু্করিকা, ওয়া হুসনি ইবাদাতিকা।",
        "english_pronunciation": "Allahumma a'inni ‘ala dhikrika, wa shukrika, wa husni ‘ibadatika.",
        "bangla_translation": "হে আল্লাহ! আমাকে আপনার স্মরণ, কৃতজ্ঞতা ও উত্তম ইবাদতের জন্য সাহায্য করুন।",
        "english_translation": "O Allah! Help me in remembering You, being grateful to You, and worshiping You in the best way.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/69.mp3"
    },
    {
        "ayah_number": 6,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ، وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
        "reference": "Sahih Muslim 588",
        "bangla_pronunciation": "আল্লাহুম্মা ইন্নি আউযু বিকা মিন ‘আজাবিন-নার, ওয়া মিন ‘আজাবিল-ক্ববর, ওয়া মিন ফিতনাতিল-মাহইয়া ওয়াল-মামাত, ওয়া মিন শাররি ফিতনাতিল-মাসীহিদ-দাজ্জাল।",
        "english_pronunciation": "Allahumma inni a'udhu bika min 'adhabin-naar, wa min 'adhabil-qabr, wa min fitnatil-mahya wal-mamat, wa min sharri fitnatil-masihid-dajjal.",
        "bangla_translation": "হে আল্লাহ! আমি আপনার কাছে জাহান্নামের শাস্তি, কবরের শাস্তি, জীবনের ও মৃত্যুর ফিতনা এবং দাজ্জালের ফিতনার অনিষ্টতা থেকে আশ্রয় চাই।",
        "english_translation": "O Allah! I seek refuge in You from the punishment of Hell, the punishment of the grave, the trials of life and death, and the evil of the trial of the False Messiah.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/70.mp3"
    },
    {
        "ayah_number": 7,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوذُ بِكَ مِنَ النَّارِ",
        "reference": "Sunan Abi Dawood 792",
        "bangla_pronunciation": "আল্লাহুম্মা ইন্নি আসআলুকাল জান্নাহ, ওয়া আউযুবিকা মিনান-নার।",
        "english_pronunciation": "Allahumma inni as'alukal-jannah, wa a'udhu bika minan-naar.",
        "bangla_translation": "হে আল্লাহ! আমি আপনার কাছে জান্নাত প্রার্থনা করছি এবং জাহান্নামের শাস্তি থেকে আপনার কাছে আশ্রয় চাই।",
        "english_translation": "O Allah! I ask You for Paradise, and I seek refuge in You from Hellfire.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/71.mp3"
    },
    {
        "ayah_number": 8,
        "arabic": "اللَّهُمَّ اغْفِرْ لِي وَلِوَالِدَيَّ، وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ، وَالْمُسْلِمِينَ وَالْمُسْلِمَاتِ، الْأَحْيَاءِ مِنْهُمْ وَالْأَمْوَاتِ",
        "reference": "Weak chain. Better reference: Sahih Ibn Hibban 944 (Mawquf, but widely accepted).",
        "bangla_pronunciation": "আল্লাহুম্মাগফিরলি, ওয়া লি-ওয়ালিদাইয়া, ওয়া লিল-মুমিনিনা ওয়াল-মুমিনাত, ওয়াল-মুসলিমিনা ওয়াল-মুসলিমাত, আল-আহইয়া-ই মিনহুম ওয়াল-আমওয়াত।",
        "english_pronunciation": "Allahummaghfir li, wa li-walidayya, wa lil-mu’minina wal-mu’minat, wal-muslimina wal-muslimat, al-ahya’i minhum wal-amwat.",
        "bangla_translation": "হে আল্লাহ! আমাকে ক্ষমা করুন, আমার পিতামাতাকে ক্ষমা করুন, সকল মুমিন পুরুষ ও নারীদের, মুসলিম পুরুষ ও নারীদের, জীবিত ও মৃতদের ক্ষমা করুন।",
        "english_translation": "O Allah! Forgive me, my parents, all believing men and women, all Muslim men and women, those who are alive and those who have passed away.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/72.mp3"
    },
    {
        "ayah_number": 9,
        "arabic": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
        "reference": "Sahih al-Bukhari 834, Sahih Muslim 2705",
        "bangla_pronunciation": "আল্লাহুম্মা ইন্নি জ্বালামতু নাফসি জুলমান কাফিরা, ওলা ইয়াগফিরুজ-জুনুবা ইল্লা আনতা, ফাগফিরলি মাগফিরাতাম মিন ইন্দিকা, ওয়ারহামনি, ইন্নাকা আনতাল গাফুরুর রাহিম।",
        "english_pronunciation": "Allahumma inni zalamtu nafsi zulman kathira, wa la yaghfirudh-dhunuba illa anta, faghfir li maghfiratan min 'indika, warhamni, innaka antal-ghafurur-rahim.",
        "bangla_translation": "হে আল্লাহ! আমি নিজের ওপর অনেক অত্যাচার করেছি, আর আপনি ছাড়া কেউই পাপ ক্ষমা করতে পারে না। তাই আমাকে আপনার পক্ষ থেকে ক্ষমা করুন এবং দয়া করুন। নিশ্চয়ই আপনি ক্ষমাশীল ও দয়ালু।",
        "english_translation": "O Allah! I have wronged myself greatly, and no one forgives sins except You. So grant me forgiveness from You and have mercy on me. Indeed, You are the Most Forgiving, the Most Merciful.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/73.mp3"
    },
    {
        "ayah_number": 10,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ",
        "reference": "Sunan Abi Dawood 5090",
        "bangla_pronunciation": "আল্লাহুম্মা ইন্নি আউযুবিকা মিনাল কুফরি ওয়াল ফাকরি, ওয়া আউযুবিকা মিন ‘আজাবিল-ক্ববর, লা ইলাহা ইল্লা আনত।",
        "english_pronunciation": "Allahumma inni a'udhu bika minal-kufri wal-faqri, wa a'udhu bika min 'adhabil-qabr, la ilaha illa anta.",
        "bangla_translation": "হে আল্লাহ! আমি আপনার কাছে কুফর ও দারিদ্র্য থেকে আশ্রয় চাই, আমি আপনার কাছে কবরের শাস্তি থেকে আশ্রয় চাই। আপনি ছাড়া কোনো উপাস্য নেই।",
        "english_translation": "O Allah! I seek refuge in You from disbelief and poverty, and I seek refuge in You from the punishment of the grave. There is no deity except You.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/74.mp3"
    },
    {
        "ayah_number": 11,
        "arabic": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
        "reference": "Quran 2:255, Sahih an-Nasa’i 984, Abu Dawood 1523",
        "bangla_pronunciation": "আল্লাহু লা ইলাহা ইল্লা হুয়াল হাইয়্যুল কাইয়্যুম, লা তা’খুযুহু সিনাতুওঁ ওয়ালা নাউম, লাহু মা ফিস্ সামাওয়াতি ওয়া মা ফিল আরদ, মান্ যাল্লাযী ইয়াশফাউ ইন্দাহু ইল্লা বি ইজনিহ, ইয়া’লামু মা বাইনা আইদীহিম ওয়া মা খালফাহুম, ওয়ালা ইউহীতূনা বিশাই’ইম্ মিন্ ইলমিহি ইল্লা বিমা শা’, ওয়াসি’য়া কুরসিইহুস সামাওয়াতি ওয়াল আরদ, ওয়ালা ইয়া’উদুহু হিফযুহুমা, ওয়া হুয়াল আলিয়্যুল আজিম।",
        "english_pronunciation": "Allahu la ilaha illa huwal hayyul qayyum, la ta'khudhuhu sinatun wa la nawm, lahu ma fis-samawati wa ma fil-ard, man dhal-ladhi yashfa'u 'indahu illa bi-idhnih, ya'lamu ma bayna aydihim wa ma khalfahum, wa la yuhituna bishay'in min 'ilmihi illa bima sha', wasi'a kursiyyuhus-samawati wal-ard, wa la ya'uduhu hifdhuhuma, wa huwal 'aliyyul 'azim.",
        "bangla_translation": "আল্লাহ! তিনি ছাড়া কোনো ইলাহ নেই, তিনি চিরঞ্জীব, সবার পালনকর্তা। তাঁকে কখনো তন্দ্রা বা নিদ্রা স্পর্শ করে না। আকাশমণ্ডলী ও পৃথিবীতে যা কিছু আছে সবই তাঁর। কে আছেন, যিনি তাঁর অনুমতি ছাড়া তাঁর নিকট সুপারিশ করতে পারেন? তিনি জানেন যা কিছু তাদের সামনে ও পেছনে রয়েছে। তাঁর জ্ঞানের কণামাত্রও তারা আয়ত্ত করতে পারে না, তবে তিনি যা চান তা ছাড়া। তাঁর কুরসী আকাশমণ্ডলী ও পৃথিবী পরিব্যাপ্ত করেছে এবং এগুলোর সংরক্ষণ তাঁকে ক্লান্ত করে না। তিনি সর্বোচ্চ, মহান।",
        "english_translation": "Allah! There is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
        "audio_link": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/255.mp3"
    },
    {
        "ayah_number": 12,
        "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ۝ اللَّهُ الصَّمَدُ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ۝ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ",
        "reference": "Sahih Muslim 1340",
        "bangla_pronunciation": "কুল হুয়াল্লাহু আহাদ, আল্লাহুস সামাদ, লাম ইয়ালিদ ওয়ালাম ইউলাদ, ওয়ালাম ইয়াকুল্লাহু কুফুওয়ান আহাদ।",
        "english_pronunciation": "Qul huwallahu ahad, Allahus-samad, Lam yalid wa lam yulad, Wa lam yakun lahu kufuwan ahad.",
        "bangla_translation": "বলুন, তিনি আল্লাহ, এক, আল্লাহ নির্ভরযোগ্য, তিনি জন্ম দেননি এবং জন্ম নেননি, এবং তাঁর সমতুল্য কেউ নেই।",
        "english_translation": "Say: He is Allah, the One; Allah, the Eternal Refuge; He neither begets nor is born; Nor is there to Him any equivalent.",
        "audio_link": "https://www.islamicfinder.org/audio/surah/112.mp3"
    },
    {
        "ayah_number": 13,
        "arabic": "سُبْحَانَ اللَّهِ ٣٣ مَرَّةً، وَالْحَمْدُ لِلَّهِ ٣٣ مَرَّةً، وَاللَّهُ أَكْبَرُ ٣٤ مَرَّةً",
        "reference": "Sahih Muslim 596 ",
        "bangla_pronunciation": "সুবহানাল্লাহ ৩৩ বার, আলহামদুলিল্লাহ ৩৩ বার, আল্লাহু আকবার ৩৪ বার।",
        "english_pronunciation": "SubhanAllah (33 times), Alhamdulillah (33 times), Allahu Akbar (34 times).",
        "bangla_translation": "আল্লাহ পবিত্র, সমস্ত প্রশংসা আল্লাহর, এবং আল্লাহ সর্বশ্রেষ্ঠ। (এই ধরণে ৩৩, ৩৩, ৩৪ বার)",
        "english_translation": "Glory be to Allah, all praise is for Allah, and Allah is the Greatest. (Repeated 33, 33, and 34 times)",
        "audio_link": "https://www.islamicfinder.org/audio/dua/75.mp3"
    },
    {
        "ayah_number": 14,
        "arabic": "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ، وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
        "reference": "Jami' at-Tirmidhi 55",
        "bangla_pronunciation": "আল্লাহুম্মাজআলনি মিনাত-তাওয়াবীন, ওয়াজআলনি মিনাল-মুতাতাহহিরীন।",
        "english_pronunciation": "Allahummaj 'alni minat-tawwabin, waj 'alni minal-mutatahhirin.",
        "bangla_translation": "হে আল্লাহ! আমাকে তওবা কারীদের অন্তর্ভুক্ত করুন এবং আমাকে পবিত্রদের অন্তর্ভুক্ত করুন।",
        "english_translation": "O Allah! Make me among those who repent and those who purify themselves.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/76.mp3"
    },
    {
        "ayah_number": 15,
        "arabic": "لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "reference": "Sahih Muslim 594",
        "bangla_pronunciation": "লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারিকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়া হুয়া ‘আলা কুল্লি শাই’ইন ক্বাদির।",
        "english_pronunciation": "La ilaha illallahu wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa huwa ‘ala kulli shay’in qadir.",
        "bangla_translation": "আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই, তিনি এক ও অদ্বিতীয়, তাঁর কোনো শরিক নেই, তাঁরই রাজত্ব ও প্রশংসা, এবং তিনি সব কিছুর উপর ক্ষমতাশালী।",
        "english_translation": "There is no deity but Allah, alone, without a partner. To Him belongs sovereignty and praise, and He has power over all things.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/77.mp3"
    },
    {
        "ayah_number": 16,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
        "reference": "Sunan Ibn Majah 925",
        "bangla_pronunciation": "আল্লাহুম্মা ইন্নি আসআলুকা ‘ইলমান নাফি’আ, ওয়া রিজকান তাইয্যিবান, ওয়া ‘আমালান মুতাক্বাবালা।",
        "english_pronunciation": "Allahumma inni as'aluka 'ilman nafi'an, wa rizqan tayyiban, wa 'amalan mutaqabbalan.",
        "bangla_translation": "হে আল্লাহ! আমি আপনার কাছে উপকারী জ্ঞান, ভালো রিজক এবং গ্রহণযোগ্য কাজ প্রার্থনা করছি।",
        "english_translation": "O Allah! I ask You for beneficial knowledge, good provision, and acceptable deeds.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/75.mp3"
    },
    {
        "ayah_number": 17,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ، وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ",
        "reference": "Sahih Muslim 2706",
        "bangla_pronunciation": "আল্লাহুম্মা ইন্নি আ’ুযুবিকা মিন শার্রি মা ‘আমিলতু, ওয়া মিন শার্রি মা লাম আ’মাল।",
        "english_pronunciation": "Allahumma inni a'udhu bika min sharri ma 'amiltu, wa min sharri ma lam a'mal.",
        "bangla_translation": "হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই আমি যা করেছি তার অপরাধ থেকে এবং আমি যা করিনি তার অপরাধ থেকে।",
        "english_translation": "O Allah! I seek refuge in You from the evil of what I have done and from the evil of what I have not done.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/76.mp3"
    },
    {
        "ayah_number": 18,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْبُخْلِ، وَالْهَرَمِ، وَعَذَابِ الْقَبْرِ",
        "reference": "Sahih al-Bukhari 6369, Sahih Muslim 2708",
        "bangla_pronunciation": "আল্লাহুম্মা ইন্নি আ’ুযুবিকা মিনাল আজজি ওয়াল কাসালি, ওয়াল জুবনি ওয়াল বুখলি, ওয়াল হারামি, ওয়া’যাবিল ক্ববরি।",
        "english_pronunciation": "Allahumma inni a'udhu bika minal 'ajzi wal kasali, wal jubni wal bukhli, wa harami, wa 'adhabil-qabr.",
        "bangla_translation": "হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই দুর্বলতা, অলসতা, ভয়ত্রাস, লোভ, হারামি এবং কবরের শাস্তি থেকে।",
        "english_translation": "O Allah! I seek refuge in You from helplessness, laziness, cowardice, miserliness, old age, and the torment of the grave.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/80.mp3"
    },
    {
        "ayah_number": 19,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
        "reference": "Sahih Muslim 2708",
        "bangla_pronunciation": "আল্লাহুম্মা ইন্নি আ’ুযুবিকা মিনাল মা’সথামি ওয়াল মাগরামি।",
        "english_pronunciation": "Allahumma inni a'udhu bika minal ma'thami wal maghrami.",
        "bangla_translation": "হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই পাপ এবং দুর্বলতা থেকে।",
        "english_translation": "O Allah! I seek refuge in You from sins and debt.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/78.mp3"
    },
    {
        "ayah_number": 20,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ الْقَبْرِ، وَعَذَابِ النَّارِ",
        "reference": "Sahih Muslim 2708",
        "bangla_pronunciation": "আল্লাহুম্মা ইন্নি আ’ুযুবিকা মিন ফিতনাতিদ দুনইয়া ওয়া’যাবিল ক্ববরি, ওয়া’যাবিন্নার।",
        "english_pronunciation": "Allahumma inni a'udhu bika min fitnatid-dunya wa 'adhabil-qabr, wa 'adhabin-nar.",
        "bangla_translation": "হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই দুনিয়ার প্রলোভন থেকে, কবরের শাস্তি থেকে এবং আগুনের শাস্তি থেকে।",
        "english_translation": "O Allah! I seek refuge in You from the trials of this world, the torment of the grave, and the torment of the Hellfire.",
        "audio_link": "https://www.islamicfinder.org/audio/dua/81.mp3"
    }
]